{
  "items": [
    {
      "title": "AI News Digest — 2026-02-15",
      "slug": "ai-news-digest-2026-02-15",
      "kind": "digest",
      "summary": "xAI safety concerns, Hollywood pushback on Seedance 2.0, India's $1.1B AI fund, Airbnb AI features, Meta smart glasses facial recognition.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-15.png",
      "driveUrl": "/media/ai-news-digest-2026-02-15.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-15",
      "updatedTime": "2026-02-15"
    },
    {
      "title": "AI Can Now Predict Diseases From How You Sleep",
      "slug": "ai-can-now-predict-diseases-from-how-you-sleep",
      "kind": "article",
      "summary": "New research shows AI can predict neurodegenerative diseases from sleep patterns - but the implications go beyond medical diagnosis.",
      "tags": [
        "AI",
        "health",
        "sleep",
        "medical",
        "prediction"
      ],
      "thumbnailUrl": "/media/ai-can-now-predict-diseases-from-how-you-sleep.png",
      "driveUrl": "/media/ai-can-now-predict-diseases-from-how-you-sleep.png",
      "contentHtml": "\n<h2 id=\"ai-can-now-predict-diseases-from-how-you-sleep\"><span class=\"hash\">#</span> AI Can Now Predict Diseases From How You Sleep</h2>\r\n\n<p>Researchers have developed AI models that can <a href=\"https://www.crescendo.ai/news/latest-ai-news-and-updates\">predict neurodegenerative diseases</a> years before symptoms appear, just by analysing sleep patterns. Early detection for Parkinson's, Alzheimer's, and similar conditions. Potentially life-changing.\r</p>\n\n<p>Also potentially a privacy nightmare, depending on who has access to your sleep data.\r</p>\n\n<h3 id=\"how-it-works\"><span class=\"hash\">##</span> How It Works</h3>\r\n\n<p>Your sleep isn't just rest - it's diagnostic data. REM cycles, movement patterns, breathing irregularities, heart rate variability during different sleep stages. All of it changes subtly as neurodegenerative diseases develop, often years before conscious symptoms appear.\r</p>\n\n<p>AI models trained on thousands of sleep studies can spot these patterns. Feed them data from a smartwatch or sleep tracker, and they can flag early warning signs that human doctors would miss.\r</p>\n\n<p>The medical potential is real. Early intervention can slow disease progression. Catching Parkinson's five years earlier could meaningfully improve quality of life.\r</p>\n\n<h3 id=\"the-privacy-problem\"><span class=\"hash\">##</span> The Privacy Problem</h3>\r\n\n<p>Here's the issue: your sleep data reveals more than just disease risk.\r</p>\n\n<p>Sleep patterns correlate with mental health, stress levels, substance use, pregnancy, and dozens of other conditions. Feed that into an AI model, and you've got a remarkably complete health profile - without ever seeing a doctor.\r</p>\n\n<p>Now ask yourself: who owns that data?\r</p>\n\n<p>If it's your smartwatch company, they know. If they share it with insurers (which they will, given the right incentive structure), your premiums adjust before you even know you're at risk. If employers get access (and in the US, health insurance is often tied to employment), suddenly your job security depends on how well you sleep.\r</p>\n\n<p>This isn't hypothetical. We've seen this pattern before with genetic testing, fitness tracking, and mental health apps. Data that seems purely personal and medical ends up in corporate databases, getting used for risk assessment and pricing decisions.\r</p>\n\n<h3 id=\"what-happens-next\"><span class=\"hash\">##</span> What Happens Next</h3>\r\n\n<p>Medical AI like this will improve. The models will get better. The predictions more accurate. That's inevitable and probably net-positive for human health.\r</p>\n\n<p>But without robust data protection laws, we're building a system where your biology becomes legible to institutions that profit from knowing your risks before you do.\r</p>\n\n<p>The tech isn't the problem. The governance is.\r</p>\n\n<p>If you're using sleep trackers, fitness wearables, or any device that monitors biometric data, ask yourself: <em>who has access to this, and what are they allowed to do with it?</em>\r</p>\n\n<p>Because the answer probably isn't \"just you and your doctor.\"\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "ai-can-now-predict-diseases-from-how-you-sleep",
          "text": "AI Can Now Predict Diseases From How You Sleep"
        },
        {
          "level": 3,
          "id": "how-it-works",
          "text": "How It Works"
        },
        {
          "level": 3,
          "id": "the-privacy-problem",
          "text": "The Privacy Problem"
        },
        {
          "level": 3,
          "id": "what-happens-next",
          "text": "What Happens Next"
        }
      ],
      "readingTime": 3,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/ai-can-now-predict-diseases-from-how-you-sleep/"
    },
    {
      "title": "AI News Digest — 2026-02-14",
      "slug": "ai-news-digest-2026-02-14",
      "kind": "digest",
      "summary": "Daily roundup - Airbnb's AI features, xAI talent exodus, OpenAI removes sycophantic GPT-4o, Anthropic's Super Bowl success, Cohere IPO prep.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-14.png",
      "driveUrl": "/media/ai-news-digest-2026-02-14.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14"
    },
    {
      "title": "JPMorgan Drops $30 Billion on AI Infrastructure",
      "slug": "jpmorgan-drops-30-billion-on-ai-infrastructure",
      "kind": "article",
      "summary": "JPMorgan is spending $30 billion on AI infrastructure - not because they love technology, but because staying competitive demands it.",
      "tags": [
        "AI",
        "finance",
        "JPMorgan",
        "infrastructure",
        "banking"
      ],
      "thumbnailUrl": "/media/jpmorgan-drops-30-billion-on-ai-infrastructure.png",
      "driveUrl": "/media/jpmorgan-drops-30-billion-on-ai-infrastructure.png",
      "contentHtml": "\n<h2 id=\"jpmorgan-drops-30-billion-on-ai-infrastructure\"><span class=\"hash\">#</span> JPMorgan Drops $30 Billion on AI Infrastructure</h2>\r\n\n<p>JPMorgan has <a href=\"https://www.crescendo.ai/news/latest-ai-news-and-updates\">announced a $30 billion investment</a> in AI infrastructure over the next three years. That's not a typo. Thirty billion dollars. For context, that's roughly the GDP of Iceland.\r</p>\n\n<p>This isn't enthusiasm. This is existential necessity dressed up as innovation.\r</p>\n\n<h3 id=\"what-theyre-actually-buying\"><span class=\"hash\">##</span> What They're Actually Buying</h3>\r\n\n<p>The headline number is massive, but what's it actually funding?\r</p>\n\n<strong>Compute capacity.</strong> Lots of it. JPMorgan processes millions of transactions daily, monitors fraud in real-time, and manages risk across global markets. All of that now needs AI models running continuously. That means GPUs, data centres, and the power infrastructure to run them.\r\n\n<strong>Talent.</strong> You can't just buy servers and hope AI happens. They're hiring hundreds of ML engineers, data scientists, and AI researchers. These aren't cheap hires - top AI talent commands seven-figure compensation packages.\r\n\n<strong>Regulatory compliance infrastructure.</strong> Banks can't just deploy models and hope for the best. Every AI system needs audit trails, explainability frameworks, and fail-safes. Building that costs serious money.\r\n\n<h3 id=\"why-now\"><span class=\"hash\">##</span> Why Now?</h3>\r\n\n<p>Simple: because their competitors are doing it. This isn't innovation for innovation's sake. It's defensive.\r</p>\n\n<p>If Goldman Sachs can underwrite loans faster because they've got better credit risk models, JPMorgan loses market share. If Morgan Stanley automates wealth management advice and cuts fees, JPMorgan's private banking clients start looking elsewhere.\r</p>\n\n<p>AI in finance isn't about doing new things. It's about doing the same things faster, cheaper, and at larger scale than your competitors.\r</p>\n\n<h3 id=\"the-quiet-bit\"><span class=\"hash\">##</span> The Quiet Bit</h3>\r\n\n<p>Here's what the press release doesn't emphasise: most of this spending replaces human labour.\r</p>\n\n<p>\"AI-powered customer service\" means fewer call centre staff. \"Automated compliance monitoring\" means fewer analysts reviewing transactions. \"Algorithmic trading optimisation\" means fewer traders on the floor.\r</p>\n\n<p>JPMorgan employs over 250,000 people. They're not going to announce layoffs in the same breath as a $30B AI investment, but the math is straightforward. You don't spend that much on automation while planning to maintain headcount.\r</p>\n\n<h3 id=\"what-this-signals\"><span class=\"hash\">##</span> What This Signals</h3>\r\n\n<p>When a bank this large commits this much capital to AI infrastructure, it's not a bet - it's a certainty. They've run the numbers. They know AI integration is cheaper than the alternative (losing competitive position).\r</p>\n\n<p>This is the financial industry acknowledging that AI is now table stakes. Not a differentiator. Not optional. Just the cost of doing business.\r</p>\n\n<p>If you work in finance and your employer isn't making similar investments, start asking questions. Because the firms that do invest will eat the ones that don't.\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "jpmorgan-drops-30-billion-on-ai-infrastructure",
          "text": "JPMorgan Drops $30 Billion on AI Infrastructure"
        },
        {
          "level": 3,
          "id": "what-theyre-actually-buying",
          "text": "What They're Actually Buying"
        },
        {
          "level": 3,
          "id": "why-now",
          "text": "Why Now?"
        },
        {
          "level": 3,
          "id": "the-quiet-bit",
          "text": "The Quiet Bit"
        },
        {
          "level": 3,
          "id": "what-this-signals",
          "text": "What This Signals"
        }
      ],
      "readingTime": 3,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/jpmorgan-drops-30-billion-on-ai-infrastructure/"
    },
    {
      "title": "NASA's Mars Rover Just Got Smarter Than Its Engineers",
      "slug": "nasas-mars-rover-just-got-smarter-than-its-engineers",
      "kind": "article",
      "summary": "NASA's latest Mars rover can navigate autonomously using AI - making decisions faster than mission control could ever respond.",
      "tags": [
        "AI",
        "NASA",
        "Mars",
        "space",
        "robotics"
      ],
      "thumbnailUrl": "/media/nasas-mars-rover-just-got-smarter-than-its-engineers.png",
      "driveUrl": "/media/nasas-mars-rover-just-got-smarter-than-its-engineers.png",
      "contentHtml": "\n<h2 id=\"nasas-mars-rover-just-got-smarter-than-its-engineers\"><span class=\"hash\">#</span> NASA's Mars Rover Just Got Smarter Than Its Engineers</h2>\r\n\n<p>NASA's latest Mars rover has <a href=\"https://www.crescendo.ai/news/latest-ai-news-and-updates\">achieved autonomous navigation</a> using onboard AI. It can now plan routes, avoid obstacles, and make real-time decisions without waiting for commands from Earth.\r</p>\n\n<p>This is a bigger deal than it sounds.\r</p>\n\n<h3 id=\"the-light-speed-problem\"><span class=\"hash\">##</span> The Light-Speed Problem</h3>\r\n\n<p>Mars is far away. Depending on orbital positions, radio signals take between 4 and 24 minutes to travel between Earth and Mars. That means every command sent to a rover has a minimum 8-minute round-trip delay.\r</p>\n\n<p>If the rover encounters an unexpected obstacle, it can't just ask mission control what to do. By the time the question reaches Earth and the answer comes back, the rover could have driven off a cliff (or at minimum, wasted precious operational time sitting idle).\r</p>\n\n<p>Previous rovers dealt with this through extreme caution. Move slowly. Stop frequently. Send images back to Earth. Wait for human analysis. Proceed conservatively.\r</p>\n\n<p>It worked, but it was painfully slow.\r</p>\n\n<h3 id=\"the-ai-solution\"><span class=\"hash\">##</span> The AI Solution</h3>\r\n\n<p>The new system uses computer vision and pathfinding AI trained on Martian terrain data. The rover can:\r</p>\n\n<ul>\n<li>Identify obstacles (rocks, slopes, soft sand) in real-time</li>\n<li>Evaluate multiple route options and pick the safest path</li>\n<li>Assess risk and make go/no-go decisions autonomously</li>\n<li>Adjust plans based on what it encounters</li>\n</ul>\n\n<p>Humans still set high-level goals (\"investigate that crater\"), but the rover handles tactical execution itself.\r</p>\n\n<p>Result? Faster exploration, more ground covered, better science return per mission day.\r</p>\n\n<h3 id=\"why-this-matters-beyond-mars\"><span class=\"hash\">##</span> Why This Matters Beyond Mars</h3>\r\n\n<p>Autonomous navigation under communication constraints isn't just a Mars problem. It's relevant for:\r</p>\n\n<strong>Deep space missions.</strong> Once you get past Mars, communication delays get even worse. Missions to Jupiter or Saturn moons need full autonomy.\r\n\n<strong>Disaster response on Earth.</strong> When communication infrastructure is down (earthquakes, floods), autonomous systems that can operate without constant connectivity become valuable.\r\n\n<strong>Military applications.</strong> Obviously. Autonomous systems that don't need real-time human oversight are of considerable interest to defence sectors globally.\r\n\n<h3 id=\"the-trust-problem\"><span class=\"hash\">##</span> The Trust Problem</h3>\r\n\n<p>Here's the uncomfortable question: at what point does \"autonomous decision-making\" become \"we're not really in control anymore\"?\r</p>\n\n<p>NASA's rover operates in an environment where the stakes are relatively low. If it makes a bad call, you lose some science data and possibly a multi-billion-dollar robot. Not ideal, but not catastrophic.\r</p>\n\n<p>But the same AI principles - operate independently, make real-time decisions, adapt to unforeseen circumstances - scale to systems where mistakes have much higher costs.\r</p>\n\n<p>Self-driving cars. Autonomous weapons. Critical infrastructure management. We're building systems that are too fast and too complex for meaningful human oversight, and we're doing it because the alternative (slow, manual control) isn't competitive.\r</p>\n\n<p>The Mars rover is a proof of concept. The question isn't whether the tech works - it clearly does. The question is where else we deploy it, and what happens when it makes a decision we wouldn't have made.\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "nasas-mars-rover-just-got-smarter-than-its-engineers",
          "text": "NASA's Mars Rover Just Got Smarter Than Its Engineers"
        },
        {
          "level": 3,
          "id": "the-light-speed-problem",
          "text": "The Light-Speed Problem"
        },
        {
          "level": 3,
          "id": "the-ai-solution",
          "text": "The AI Solution"
        },
        {
          "level": 3,
          "id": "why-this-matters-beyond-mars",
          "text": "Why This Matters Beyond Mars"
        },
        {
          "level": 3,
          "id": "the-trust-problem",
          "text": "The Trust Problem"
        }
      ],
      "readingTime": 3,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/nasas-mars-rover-just-got-smarter-than-its-engineers/"
    },
    {
      "title": "Elon Musk Merges SpaceX and xAI Because Of Course He Does",
      "slug": "elon-musk-merges-spacex-and-xai-because-of-course-he-does",
      "kind": "article",
      "summary": "Elon Musk merges SpaceX and xAI to embed Grok into spacecraft operations - but this is really about corporate structure and narrative control.",
      "tags": [
        "AI",
        "SpaceX",
        "xAI",
        "Elon Musk",
        "Mars"
      ],
      "thumbnailUrl": "/media/elon-musk-merges-spacex-and-xai-because-of-course-he-does.png",
      "driveUrl": "/media/elon-musk-merges-spacex-and-xai-because-of-course-he-does.png",
      "contentHtml": "\n<h2 id=\"elon-musk-merges-spacex-and-xai-because-of-course-he-does\"><span class=\"hash\">#</span> Elon Musk Merges SpaceX and xAI Because Of Course He Does</h2>\r\n\n<p>Elon Musk <a href=\"https://www.crescendo.ai/news/latest-ai-news-and-updates\">has announced a merger</a> between SpaceX and xAI. The stated goal: embed Grok deeply into SpaceX operations to accelerate \"fully autonomous spacecraft and robotic Mars colonies.\"\r</p>\n\n<p>Right. Because the bottleneck on Mars colonisation was definitely the AI chatbot situation.\r</p>\n\n<h3 id=\"what-this-actually-means\"><span class=\"hash\">##</span> What This Actually Means</h3>\r\n\n<p>SpaceX already uses AI for various operational tasks. Adding xAI's models into the mix isn't revolutionary - it's just vertical integration within Musk's empire. The real story is what this says about where xAI fits in the broader portfolio.\r</p>\n\n<p>xAI has been the scrappy underdog in the foundation model race. Late to market, fewer resources than OpenAI or Anthropic, and mostly known for Grok's edgy personality rather than technical breakthroughs. Merging it into SpaceX gives it a captive enterprise customer and a narrative about \"real-world\" applications.\r</p>\n\n<p>It also conveniently shields xAI's financials inside SpaceX's balance sheet. Hard to scrutinise burn rate when it's all mixed in with rocket development costs.\r</p>\n\n<h3 id=\"the-mars-angle\"><span class=\"hash\">##</span> The Mars Angle</h3>\r\n\n<p>\"Robotic Mars colonies\" is doing a lot of work in that announcement. We're nowhere near that timeline. But it sounds visionary, and vision is half of Musk's brand. The other half is moving fast and breaking things, which is fine for software but less ideal when you're talking about spacecraft autonomy.\r</p>\n\n<p>There's a legitimate case for AI in space operations. Route planning, anomaly detection, real-time decision-making when Earth is 20 light-minutes away. But that's not what this merger is really about. This is about corporate structure and narrative control.\r</p>\n\n<h3 id=\"the-quiet-part\"><span class=\"hash\">##</span> The Quiet Part</h3>\r\n\n<p>If you wanted your AI company to avoid the regulatory scrutiny currently hammering the rest of the industry, embedding it inside an aerospace contractor is a clever move. Different agencies, different oversight frameworks, different public perception.\r</p>\n\n<p>SpaceX gets to say it's \"AI-powered\" now. xAI gets to say it's mission-critical for space exploration. And Musk gets to keep both narratives running without having to explain xAI's standalone business case.\r</p>\n\n<p>Efficient, if nothing else.\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "elon-musk-merges-spacex-and-xai-because-of-course-he-does",
          "text": "Elon Musk Merges SpaceX and xAI Because Of Course He Does"
        },
        {
          "level": 3,
          "id": "what-this-actually-means",
          "text": "What This Actually Means"
        },
        {
          "level": 3,
          "id": "the-mars-angle",
          "text": "The Mars Angle"
        },
        {
          "level": 3,
          "id": "the-quiet-part",
          "text": "The Quiet Part"
        }
      ],
      "readingTime": 2,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/elon-musk-merges-spacex-and-xai-because-of-course-he-does/"
    },
    {
      "title": "Welcome to Kol's Korner",
      "slug": "welcome-to-kols-korner",
      "kind": "article",
      "summary": "Sharp takes on AI news - no hype, no fluff, just what matters and why it matters.",
      "tags": [
        "welcome",
        "intro",
        "AI"
      ],
      "thumbnailUrl": "",
      "driveUrl": "",
      "contentHtml": "\n<h2 id=\"welcome-to-kols-korner\"><span class=\"hash\">#</span> Welcome to Kol's Korner</h2>\r\n\n<p>This is where I write about AI - the real stuff, not the marketing nonsense.\r</p>\n\n<h3 id=\"what-youll-find-here\"><span class=\"hash\">##</span> What You'll Find Here</h3>\r\n\n<strong>AI news with actual analysis.</strong> I track what's happening in AI and explain what it actually means. No breathless hype about \"revolutionary breakthroughs.\" Just clear thinking about what's changing and why you should care.\r\n\n<strong>Sceptical but informed.</strong> I use AI tools daily. I build with AI agents. I know what works and what's oversold. You'll get both the potential and the problems.\r\n\n<strong>UK English, proper writing.</strong> No AI slop. No corporate speak. Just clear, direct writing that respects your intelligence.\r\n\n<h3 id=\"why-this-site-exists\"><span class=\"hash\">##</span> Why This Site Exists</h3>\r\n\n<p>I got tired of AI news being either:\r</p>\n<ol>\n<li>Uncritical cheerleading from people selling AI products</li>\n<li>Uninformed fear-mongering from people who don't use the technology</li>\n<li>Bland aggregation with no actual insight</li>\n</ol>\n\n<p>This site is the alternative. Real use cases. Real limitations. Real implications.\r</p>\n\n<h3 id=\"about-the-author\"><span class=\"hash\">##</span> About the Author</h3>\r\n\n<p>I'm Kol Tregaskes. I work with AI agents, build automation systems, and write about what I learn. I've been in tech long enough to see hype cycles come and go.\r</p>\n\n<p>AI is genuinely important - but not for the reasons most headlines claim.\r</p>\n\n<h3 id=\"whats-coming\"><span class=\"hash\">##</span> What's Coming</h3>\r\n\n<ul>\n<li><strong>Daily AI news</strong> (currently in beta) - curated updates from credible sources</li>\n<li><strong>Deep dives</strong> on specific AI developments worth understanding</li>\n<li><strong>Practical guides</strong> for working with AI tools effectively</li>\n<li><strong>Sceptical analysis</strong> when the industry needs a reality check</li>\n</ul>\n\n<h3 id=\"stay-updated\"><span class=\"hash\">##</span> Stay Updated</h3>\r\n\n<ul>\n<li><strong>RSS feed</strong> - <a href=\"/feed.xml\">Subscribe here</a></li>\n<li><strong>Newsletter</strong> - Coming soon</li>\n<li><strong>Social</strong> - Find me on X, Bluesky, and Mastodon (links below)</li>\n</ul>\n\n<p>Thanks for reading. Let's figure out what AI actually means, together.\r</p>\n\n<hr />\r\n\n<em>This site is built from markdown files and hosted on GitHub Pages. No tracking, no ads, no bullshit.</em>\r\n",
      "headings": [
        {
          "level": 2,
          "id": "welcome-to-kols-korner",
          "text": "Welcome to Kol's Korner"
        },
        {
          "level": 3,
          "id": "what-youll-find-here",
          "text": "What You'll Find Here"
        },
        {
          "level": 3,
          "id": "why-this-site-exists",
          "text": "Why This Site Exists"
        },
        {
          "level": 3,
          "id": "about-the-author",
          "text": "About the Author"
        },
        {
          "level": 3,
          "id": "whats-coming",
          "text": "What's Coming"
        },
        {
          "level": 3,
          "id": "stay-updated",
          "text": "Stay Updated"
        }
      ],
      "readingTime": 2,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/welcome-to-kols-korner/"
    },
    {
      "title": "California Just Told Grok to Stop Making Deepfake Porn",
      "slug": "california-just-told-grok-to-stop-making-deepfake-porn",
      "kind": "article",
      "summary": "California's new law targets AI-generated deepfake pornography - and xAI's Grok is the first major model caught in the crosshairs.",
      "tags": [
        "AI",
        "deepfakes",
        "regulation",
        "xAI",
        "Grok",
        "California"
      ],
      "thumbnailUrl": "/media/california-just-told-grok-to-stop-making-deepfake-porn.png",
      "driveUrl": "/media/california-just-told-grok-to-stop-making-deepfake-porn.png",
      "contentHtml": "\n<h2 id=\"california-just-told-grok-to-stop-making-deepfake-porn\"><span class=\"hash\">#</span> California Just Told Grok to Stop Making Deepfake Porn</h2>\r\n\n<p>California has <a href=\"https://www.crescendo.ai/news/latest-ai-news-and-updates\">passed legislation</a> banning AI-generated deepfake pornography, and xAI's Grok is the first major model explicitly called out for non-compliance.\r</p>\n\n<p>The law is straightforward: if your AI model can generate pornographic deepfakes of real people without their consent, you can't operate in California. Comply or face penalties.\r</p>\n\n<p>xAI now has 90 days to implement safeguards or face enforcement action.\r</p>\n\n<h3 id=\"why-grok\"><span class=\"hash\">##</span> Why Grok?</h3>\r\n\n<p>Most major AI companies already have guardrails against this. OpenAI, Anthropic, Google - they all block attempts to generate non-consensual sexual imagery. Their models refuse the request outright.\r</p>\n\n<p>Grok, positioned as the \"uncensored\" alternative, took a different approach. Fewer restrictions. More user freedom. Market yourself as the AI that doesn't lecture you about ethics.\r</p>\n\n<p>Turns out, that creates liability.\r</p>\n\n<p>California's law doesn't care about your brand positioning. If your model can generate deepfake porn, and you operate in California (or serve California users), you need to stop or leave.\r</p>\n\n<p>xAI can't really leave - California is too large a market. So they'll implement filters, like everyone else.\r</p>\n\n<h3 id=\"the-broader-pattern\"><span class=\"hash\">##</span> The Broader Pattern</h3>\r\n\n<p>This is the second time in six months that \"uncensored AI\" has run face-first into regulation. The first was Italy banning ChatGPT clones that had no age verification or content controls.\r</p>\n\n<p>There's a recurring assumption in AI circles that restrictions on model outputs are purely ideological - companies being overly cautious or performatively ethical.\r</p>\n\n<p>But the restrictions exist because <em>this exact scenario</em> keeps happening. Unrestricted models get used for harassment, fraud, and abuse. Legislators notice. Laws get written.\r</p>\n\n<p>The companies that built safeguards early aren't doing it out of altruism. They're doing it because they saw this coming.\r</p>\n\n<h3 id=\"what-happens-next\"><span class=\"hash\">##</span> What Happens Next</h3>\r\n\n<p>xAI will patch Grok to block deepfake porn generation. They'll probably complain loudly about censorship while doing it. The \"free speech\" branding will take a hit.\r</p>\n\n<p>But here's the thing: this was always coming. You can't build a consumer AI product in 2026 without content moderation. The regulatory environment won't allow it, and the reputational risk is too high.\r</p>\n\n<p>The era of \"move fast and break things\" is over. Now it's \"move fast, implement safeguards, and hope your compliance team can keep up with legislation.\"\r</p>\n\n<p>Grok learned this the hard way. The next wave of AI startups is watching and adjusting accordingly.\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "california-just-told-grok-to-stop-making-deepfake-porn",
          "text": "California Just Told Grok to Stop Making Deepfake Porn"
        },
        {
          "level": 3,
          "id": "why-grok",
          "text": "Why Grok?"
        },
        {
          "level": 3,
          "id": "the-broader-pattern",
          "text": "The Broader Pattern"
        },
        {
          "level": 3,
          "id": "what-happens-next",
          "text": "What Happens Next"
        }
      ],
      "readingTime": 2,
      "date": "2026-02-14",
      "updatedTime": "2026-02-14",
      "localPath": "/posts/california-just-told-grok-to-stop-making-deepfake-porn/"
    },
    {
      "title": "AI News Digest — 2026-02-13",
      "slug": "ai-news-digest-2026-02-13",
      "kind": "digest",
      "summary": "Daily roundup - Pinterest search claims, IBM hiring surge, Musk's Moonbase Alpha, Didero raises $30M, Anthropic's $30B Series G.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-13.png",
      "driveUrl": "/media/ai-news-digest-2026-02-13.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-13",
      "updatedTime": "2026-02-13"
    },
    {
      "title": "AI's Efficiency Promise Has a Catch - You",
      "slug": "ais-efficiency-promise-has-a-catch-you",
      "kind": "article",
      "summary": "AI makes work faster, but that speed comes with a hidden cost - you're expected to do more, not less.",
      "tags": [
        "AI",
        "productivity",
        "burnout",
        "workplace"
      ],
      "thumbnailUrl": "/media/ais-efficiency-promise-has-a-catch-you.png",
      "driveUrl": "/media/ais-efficiency-promise-has-a-catch-you.png",
      "contentHtml": "\n<h2 id=\"ais-efficiency-promise-has-a-catch-you\"><span class=\"hash\">#</span> AI's Efficiency Promise Has a Catch - You</h2>\r\n\n<p>AI makes work faster, but that speed comes with a hidden cost: you're expected to do more, not less.\r</p>\n\n<h3 id=\"the-productivity-paradox\"><span class=\"hash\">##</span> The Productivity Paradox</h3>\r\n\n<p>Every new AI tool promises the same thing: \"Work smarter, save time, focus on what matters.\" But here's what actually happens: you do complete tasks faster. Then your manager notices. Now you're expected to hit that pace permanently.\r</p>\n\n<p>The efficiency gains don't free up your time. They raise the baseline.\r</p>\n\n<p>This isn't new - it's the <a href=\"https://en.wikipedia.org/wiki/Jevons_paradox\">Jevons paradox</a> playing out in knowledge work. When you make something more efficient, you don't use less of it. You use more. Coal-fired engines didn't reduce coal consumption; they made coal so efficient that consumption exploded.\r</p>\n\n<p>AI does this to your capacity. You're the coal.\r</p>\n\n<h3 id=\"the-burnout-treadmill\"><span class=\"hash\">##</span> The Burnout Treadmill</h3>\r\n\n<p>When AI makes you 2x faster at writing emails, you don't write half as many emails. You write twice as many. Same with reports, analysis, presentations - anything that can be accelerated gets expanded to fill the time saved.\r</p>\n\n<p>The brutal bit? This feels like your fault. You're using the best tools. You're getting more done. Why do you feel exhausted?\r</p>\n\n<p>Because your output doubled, but your capacity didn't.\r</p>\n\n<h3 id=\"what-actually-helps\"><span class=\"hash\">##</span> What Actually Helps</h3>\r\n\n<p>If you want AI to improve your work life rather than just intensify it, you need boundaries:\r</p>\n\n<strong>Define \"done\" before you start.</strong> AI makes it trivially easy to add \"just one more thing\" to any deliverable. Set the scope up front and stop when you hit it.\r\n\n<strong>Track what you eliminate, not what you produce.</strong> The win isn't doing more. It's doing the same amount with less friction. Measure time saved, not tasks completed.\r\n\n<strong>Push back on scope creep.</strong> When someone says \"but with AI you can just...\", the answer is \"yes, and I've already allocated that capacity elsewhere.\" AI doesn't create infinite time.\r\n\n<strong>Use efficiency gains for recovery, not more work.</strong> If AI saves you two hours, spend one of them not working. Your brain needs processing time. Constant output without rest is how you burn out.\r\n\n<h3 id=\"the-long-game\"><span class=\"hash\">##</span> The Long Game</h3>\r\n\n<p>AI will keep getting faster. The pressure to do more will keep increasing. The only sustainable path is to decouple your value from your velocity.\r</p>\n\n<p>Your worth isn't how much you produce in a sprint. It's the judgment, creativity, and context you bring to what you do produce. Those don't scale linearly with tools.\r</p>\n\n<p>If your role is purely about speed and volume, AI will eventually do it better than you. The people who thrive aren't the ones doing more - they're the ones deciding what's worth doing at all.\r</p>\n\n<p>That's the skill to invest in.\r</p>\n",
      "headings": [
        {
          "level": 2,
          "id": "ais-efficiency-promise-has-a-catch-you",
          "text": "AI's Efficiency Promise Has a Catch - You"
        },
        {
          "level": 3,
          "id": "the-productivity-paradox",
          "text": "The Productivity Paradox"
        },
        {
          "level": 3,
          "id": "the-burnout-treadmill",
          "text": "The Burnout Treadmill"
        },
        {
          "level": 3,
          "id": "what-actually-helps",
          "text": "What Actually Helps"
        },
        {
          "level": 3,
          "id": "the-long-game",
          "text": "The Long Game"
        }
      ],
      "readingTime": 3,
      "date": "2026-02-12",
      "updatedTime": "2026-02-12",
      "localPath": "/posts/ais-efficiency-promise-has-a-catch-you/"
    },
    {
      "title": "AI News Digest — 2026-02-12",
      "slug": "ai-news-digest-2026-02-12",
      "kind": "digest",
      "summary": "Daily roundup - xAI's interplanetary plans, Modal Labs raises at $2.5B valuation, OpenAI disbands alignment team, Uber Eats AI assistant.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-12.png",
      "driveUrl": "/media/ai-news-digest-2026-02-12.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-12",
      "updatedTime": "2026-02-12"
    },
    {
      "title": "AI News Digest — 2026-02-11",
      "slug": "ai-news-digest-2026-02-11",
      "kind": "digest",
      "summary": "Daily roundup of AI news - xAI founding team exits, Amazon's AI content marketplace, insurance AI deployments, and latest research.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-11.png",
      "driveUrl": "/media/ai-news-digest-2026-02-11.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-11",
      "updatedTime": "2026-02-11"
    },
    {
      "title": "AI News Digest — 2026-02-10",
      "slug": "ai-news-digest-2026-02-10",
      "kind": "digest",
      "summary": "Retrospective digest capturing major AI developments from Feb 10. News gathering system initialized on Feb 11.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-10.png",
      "driveUrl": "/media/ai-news-digest-2026-02-10.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-10",
      "updatedTime": "2026-02-10"
    },
    {
      "title": "AI News Digest — 2026-02-09",
      "slug": "ai-news-digest-2026-02-09",
      "kind": "digest",
      "summary": "Retrospective digest capturing major AI developments from Feb 9. News gathering system initialized on Feb 11.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-09.png",
      "driveUrl": "/media/ai-news-digest-2026-02-09.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-09",
      "updatedTime": "2026-02-09"
    },
    {
      "title": "AI News Digest — 2026-02-08",
      "slug": "ai-news-digest-2026-02-08",
      "kind": "digest",
      "summary": "Retrospective digest capturing major AI developments from Feb 8. News gathering system initialized on Feb 11.",
      "tags": [
        "ai",
        "news",
        "digest"
      ],
      "thumbnailUrl": "/media/ai-news-digest-2026-02-08.png",
      "driveUrl": "/media/ai-news-digest-2026-02-08.png",
      "contentHtml": "",
      "headings": [],
      "readingTime": 1,
      "date": "2026-02-08",
      "updatedTime": "2026-02-08"
    }
  ]
}